Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# cli.sshPtyAttach.terminalInputFlushFailed
source: SSH terminal input could not be reset; reconnecting.
ar: تعذر إعادة ضبط إدخال طرفية SSH؛ جارٍ إعادة الاتصال.
bs: Ulaz SSH terminala nije moguće resetovati; ponovno povezivanje.
da: SSH-terminalinput kunne ikke nulstilles; opretter forbindelse igen.
de: SSH-Terminaleingabe konnte nicht zurückgesetzt werden; Verbindung wird wiederhergestellt.
es: No se pudo restablecer la entrada del terminal SSH; reconectando.
fr: L’entrée du terminal SSH n’a pas pu être réinitialisée ; reconnexion.
it: Impossibile reimpostare l’input del terminale SSH; riconnessione.
ja: SSH ターミナル入力をリセットできませんでした。再接続します。
ko: SSH 터미널 입력을 재설정할 수 없습니다. 다시 연결합니다.
nb: SSH-terminalinndata kunne ikke tilbakestilles; kobler til på nytt.
pl: Nie można zresetować wejścia terminala SSH; ponowne łączenie.
pt_br: Não foi possível redefinir a entrada do terminal SSH; reconectando.
ru: Не удалось сбросить ввод терминала SSH; выполняется переподключение.
th: รีเซ็ตอินพุตเทอร์มินัล SSH ไม่ได้ กำลังเชื่อมต่อใหม่
tr: SSH terminal girişi sıfırlanamadı; yeniden bağlanılıyor.
uk: Не вдалося скинути ввід термінала SSH; повторне підключення.
zh_hans: 无法重置 SSH 终端输入；正在重新连接。
zh_hant: 無法重設 SSH 終端輸入；正在重新連線。

# cli.sshPtyAttach.terminalInputTransitionFailed
source: SSH terminal input could not enter reconnect mode.
ar: تعذر إدخال طرفية SSH في وضع إعادة الاتصال.
bs: Ulaz SSH terminala nije moguće prebaciti u režim ponovnog povezivanja.
da: SSH-terminalinput kunne ikke skifte til genforbindelsestilstand.
de: SSH-Terminaleingabe konnte nicht in den Wiederverbindungsmodus wechseln.
es: No se pudo cambiar la entrada del terminal SSH al modo de reconexión.
fr: L’entrée du terminal SSH n’a pas pu passer en mode reconnexion.
it: Impossibile passare l’input del terminale SSH alla modalità di riconnessione.
ja: SSH ターミナル入力を再接続モードに切り替えられませんでした。
ko: SSH 터미널 입력을 재연결 모드로 전환할 수 없습니다.
nb: SSH-terminalinndata kunne ikke gå inn i tilkoblingsmodus.
pl: Nie można przełączyć wejścia terminala SSH w tryb ponownego łączenia.
pt_br: Não foi possível colocar a entrada do terminal SSH no modo de reconexão.
ru: Не удалось перевести ввод терминала SSH в режим переподключения.
th: ไม่สามารถเปลี่ยนอินพุตเทอร์มินัล SSH เป็นโหมดเชื่อมต่อใหม่ได้
tr: SSH terminal girişi yeniden bağlanma moduna geçirilemedi.
uk: Не вдалося перевести ввід термінала SSH у режим повторного підключення.
zh_hans: 无法将 SSH 终端输入切换到重连模式。
zh_hant: 無法將 SSH 終端輸入切換至重新連線模式。

# cli.sshPtyAttach.bridgeClosedReattachingInputDiscard
source: [cmux] remote PTY bridge closed; reattaching (attempt %s/%s). Input typed while disconnected is discarded.
ar: [cmux] تم إغلاق جسر PTY البعيد؛ تجري إعادة الاتصال (المحاولة %s/%s). تم تجاهل الإدخال الذي تمت كتابته أثناء انقطاع الاتصال.
de: [cmux] Remote-PTY-Brücke geschlossen; erneutes Anfügen (Versuch %s/%s). Während der Trennung getätigte Eingaben werden verworfen.
es: [cmux] puente de PTY remoto cerrado; reconectando (intento %s/%s). La entrada escrita mientras se estaba desconectado se descarta.
fr: [cmux] pont PTY distant fermé ; rattachement en cours (tentative %s/%s). La saisie effectuée pendant la déconnexion est rejetée.
ja: [cmux] リモート PTY ブリッジが閉じました。再接続しています（試行 %s/%s）。切断中に入力した内容は破棄されます。
ko: [cmux] 원격 PTY 브릿지가 닫혔습니다. 재연결 중입니다 (시도 횟수: %s/%s). 연결이 끊어진 동안 입력된 내용은 무시됩니다.
zh_hans: [cmux] 远程 PTY 桥接已关闭；正在重新挂载（第 %s/%s 次尝试）。断开期间输入的内容将被丢弃。
zh_hant: [cmux] 遠端 PTY 橋接器已關閉；正在重新連接 (嘗試第 %s/%s 次)。連線中斷時輸入的內容已被捨棄。

# cli.sshPtyAttach.reconnected
source: [cmux] remote PTY reconnected (attempt %s/%s).
ar: [cmux] تمت إعادة اتصال PTY البعيد (المحاولة %s/%s).
de: [cmux] Remote-PTY wiederverbunden (Versuch %s/%s).
es: [cmux] PTY remoto reconectado (intento %s/%s).
fr: [cmux] PTY distant reconnecté (tentative %s/%s).
ja: [cmux] リモート PTY が再接続されました（試行 %s/%s）。
ko: [cmux] 원격 PTY가 재연결되었습니다 (시도 횟수: %s/%s).
zh_hans: [cmux] 远程 PTY 已重连（第 %s/%s 次尝试）。
zh_hant: [cmux] 遠端 PTY 已重新連線 (嘗試第 %s/%s 次)。

# cli.sshPtyAttach.bridgeClosedSessionRunning
source: The SSH terminal connection ended; the remote session may still be running.
ar: انتهى اتصال طرفية SSH؛ قد لا تزال الجلسة البعيدة قيد التشغيل.
de: Die SSH-Terminalverbindung wurde beendet; die Remote-Sitzung läuft möglicherweise noch.
es: Finalizó la conexión de terminal SSH; es posible que la sesión remota aún se esté ejecutando.
fr: La connexion du terminal SSH a pris fin ; la session distante est peut-être encore en cours d'exécution.
ja: SSH ターミナル接続が終了しました。リモートセッションはまだ実行中の可能性があります。
ko: SSH 터미널 연결이 종료되었습니다. 원격 세션은 계속 실행 중일 수 있습니다.
zh_hans: SSH 终端连接已结束；远程会话可能仍在运行。
zh_hant: SSH 終端機連線已結束；遠端工作階段可能仍在執行。

# cli.sshPtyAttach.bridgeClosedSessionRunningReconnecting
source: The SSH terminal connection ended while the remote session is still running; cmux is reconnecting.
ar: انتهى اتصال طرفية SSH بينما لا تزال الجلسة البعيدة قيد التشغيل؛ يقوم cmux بإعادة الاتصال.
de: Die SSH-Terminalverbindung wurde beendet, während die Remote-Sitzung noch läuft; cmux stellt die Verbindung wieder her.
es: Finalizó la conexión de terminal SSH mientras la sesión remota aún se está ejecutando; cmux se está reconectando.
fr: La connexion du terminal SSH a pris fin alors que la session distante est toujours en cours d'exécution ; cmux se reconnecte.
ja: SSH ターミナル接続が終了しましたが、リモートセッションは引き続き実行中です。再接続します。
ko: 원격 세션이 계속 실행 중인 상태에서 SSH 터미널 연결이 종료되었습니다. cmux가 재연결을 시도하고 있습니다.
zh_hans: SSH 终端连接已结束，但远程会话仍在运行；cmux 正在重连。
zh_hant: SSH 終端機連線已結束，但遠端工作階段仍在執行；cmux 正在重新連線。

# cli.sshPtyAttach.bridgeClosedWithoutProgress
source: ssh-pty-attach: bridge closed without receiving new output while the remote PTY session is still running
ar: ssh-pty-attach: تم إغلاق الجسر دون تلقي مخرجات جديدة بينما لا تزال جلسة PTY البعيدة قيد التشغيل
de: ssh-pty-attach: Brücke geschlossen, ohne dass neue Ausgaben empfangen wurden, während die Remote-PTY-Sitzung noch läuft
es: ssh-pty-attach: puente cerrado sin recibir nueva salida mientras la sesión remota de PTY aún se está ejecutando
fr: ssh-pty-attach : pont fermé sans recevoir de nouvelle sortie alors que la session PTY distante est toujours en cours d'exécution
ja: ssh-pty-attach: 新しい出力を受信しないままブリッジが閉じましたが、リモート PTY セッションは引き続き実行中です
ko: ssh-pty-attach: 원격 PTY 세션이 계속 실행 중인 상태에서 새로운 출력을 수신하지 못하고 브릿지가 닫혔습니다
zh_hans: ssh-pty-attach：远程 PTY 会话仍在运行，但桥接在未收到新输出的情况下关闭
zh_hant: ssh-pty-attach：遠端 PTY 工作階段仍在執行，但橋接器在未收到新輸出的情況下關閉

# cli.sshPtyAttach.flushInputUsage
source: Internal SSH input flush does not accept arguments.
ar: لا يقبل إفراغ إدخال SSH الداخلي وسيطات.
de: Das interne Leeren der SSH-Eingabe akzeptiert keine Argumente.
es: La purga interna de entrada SSH no acepta argumentos.
fr: La vidange interne des saisies SSH n'accepte aucun argument.
ja: 内部 SSH 入力フラッシュは引数を受け付けません。
ko: 내부 SSH 입력 플러시는 인수를 허용하지 않습니다.
zh_hans: 内部 SSH 输入清空命令不接受参数。
zh_hant: 內部 SSH 輸入清除不接受引數。

# cli.sshPtyAttach.flushInputFailed
source: SSH terminal input could not be discarded safely.
ar: تعذر تجاهل إدخال طرفية SSH بأمان.
de: Die SSH-Terminal-Eingabe konnte nicht sicher verworfen werden.
es: La entrada de la terminal SSH no pudo ser descartada de forma segura.
fr: La saisie du terminal SSH n'a pas pu être rejetée en toute sécurité.
ja: SSH ターミナルの入力を安全に破棄できませんでした。
ko: SSH 터미널 입력을 안전하게 삭제할 수 없습니다.
zh_hans: 无法安全丢弃 SSH 终端输入。
zh_hant: 無法安全地捨棄 SSH 終端機輸入。

# cli.sshPtyAttach.noProgressRetryLimitReached.one
source: [cmux] remote PTY bridge made no progress after %s attempt; stopping retries.
ar: [cmux] لم يحرز جسر PTY البعيد أي تقدم بعد محاولة واحدة (%s)؛ سيتم إيقاف محاولات إعادة الاتصال.
de: [cmux] Die Remote-PTY-Brücke hat nach %s Versuch keine Fortschritte gemacht; Versuche werden gestoppt.
es: [cmux] el puente de PTY remoto no progresó después del intento %s; se detienen los reintentos.
fr: [cmux] le pont PTY distant n'a pas progressé après %s tentative ; arrêt des tentatives.
ja: [cmux] リモート PTY ブリッジは %s 回試行しても進行しなかったため、再試行を停止します。
ko: [cmux] 원격 PTY 브릿지가 %s회 시도 후에도 전혀 응답하지 않아 재시도를 중단합니다.
zh_hans: [cmux] 远程 PTY 桥接在 %s 次尝试后仍无进展；停止重试。
zh_hant: [cmux] 遠端 PTY 橋接器在嘗試 %s 次後仍無進展；停止重試。

# cli.sshPtyAttach.noProgressRetryLimitReached.other
source: [cmux] remote PTY bridge made no progress after %s attempts; stopping retries.
ar: [cmux] لم يحرز جسر PTY البعيد أي تقدم بعد %s محاولات؛ سيتم إيقاف محاولات إعادة الاتصال.
de: [cmux] Die Remote-PTY-Brücke hat nach %s Versuchen keine Fortschritte gemacht; Versuche werden gestoppt.
es: [cmux] el puente de PTY remoto no progresó después de %s intentos; se detienen los reintentos.
fr: [cmux] le pont PTY distant n’a pas progressé après %s tentatives ; arrêt des essais.
ja: [cmux] リモート PTY ブリッジは %s 回試行しても進行しなかったため、再試行を停止します。
ko: [cmux] 원격 PTY 브릿지가 %s회 시도 후에도 전혀 응답하지 않아 재시도를 중단합니다.
zh_hans: [cmux] 远程 PTY 桥接在 %s 次尝试后仍无进展；停止重试。
zh_hant: [cmux] 遠端 PTY 橋接器在嘗試 %s 次後仍無進展；停止重試。

# cli.sshPtyAttach.reconciliationUnavailableReattach
source: The SSH terminal connection ended before the remote session state could be confirmed; preserving the remote session for reconnection.
ar: انتهى اتصال طرفية SSH قبل تأكيد حالة الجلسة البعيدة؛ سيتم الحفاظ على الجلسة البعيدة لإعادة الاتصال.
de: Die SSH-Terminal-Verbindung endete, bevor der Status der Remote-Sitzung bestätigt werden konnte; die Remote-Sitzung wird für eine erneute Verbindung beibehalten.
es: Finalizó la conexión de terminal SSH antes de que pudiera confirmarse el estado de la sesión remota; se conserva la sesión remota para la reconexión.
fr: La connexion SSH du terminal s’est terminée avant que l’état de la session distante n’ait pu être confirmé ; conservation de la session distante pour reconnexion.
ja: リモートセッションの状態を確認できる前に SSH ターミナル接続が終了しました。再接続のためセッションを維持します。
ko: 원격 세션 상태를 확인하기 전에 SSH 터미널 연결이 종료되었습니다. 재연결을 위해 원격 세션을 보존합니다.
zh_hans: SSH 终端连接在远程会话状态确认前就已结束；将保留该远程会话以便重连。
zh_hant: 在確認遠端工作階段狀態前，SSH 終端機連線已結束；保留遠端工作階段以便重新連線。

# cli.sshPtyAttach.remoteSessionLostRespawn
source: [cmux] remote session was lost; starting a new shell.
ar: [cmux] فُقدت الجلسة البعيدة؛ يجري بدء شل جديد.
de: [cmux] Remote-Sitzung ging verloren; eine neue Shell wird gestartet.
es: [cmux] se perdió la sesión remota; iniciando un nuevo shell.
fr: [cmux] la session distante a été perdue ; démarrage d’un nouveau shell.
ja: [cmux] リモートセッションが失われました。新しいシェルを開始します。
ko: [cmux] 원격 세션이 유실되었습니다. 새로운 셸을 시작합니다.
zh_hans: [cmux] 远程会话已丢失；正在启动新的 shell。
zh_hant: [cmux] 遠端工作階段已遺失；正在啟動新的 Shell。

# cli.sshPtyAttach.terminalInputGuardFailed
source: SSH reattach stopped because queued terminal input could not be protected.
ar: توقفت إعادة اتصال SSH لأنه تعذر حماية إدخال الطرفية الموضوع في قائمة الانتظار.
de: Das erneute SSH-Verbinden wurde gestoppt, da die in der Warteschlange befindliche Terminal-Eingabe nicht geschützt werden konnte.
es: Se detuvo la reconexión SSH porque no se pudo proteger la entrada de terminal en cola.
fr: La connexion de re-rattachement SSH a été arrêtée car les entrées de terminal en file d’attente n’ont pas pu être protégées.
ja: キューに入ったターミナル入力を保護できなかったため、SSH の再接続を停止しました。
ko: 대기 중인 터미널 입력을 보호할 수 없어 SSH 재연결을 중단했습니다.
zh_hans: SSH 重新挂载已中止，因为无法保护已排队的终端输入。
zh_hant: 由於無法保護排隊中的終端機輸入，SSH 重新連接已停止。

# cli.sshSessionList.remoteStateUnavailable
source: Remote PTY session state is unavailable for one or more workspaces.
ar: حالة جلسة PTY البعيدة غير متاحة لمساحة عمل واحدة أو أكثر.
de: Der Remote-PTY-Sitzungsstatus ist für einen oder mehrere Arbeitsbereiche nicht verfügbar.
es: El estado de la sesión remota de PTY no está disponible para uno o más espacios de trabajo.
fr: L’état de la session PTY distante est indisponible pour un ou plusieurs espaces de travail.
ja: 1 つ以上のワークスペースでリモート PTY セッションの状態を取得できません。
ko: 하나 이상의 작업 공간에서 원격 PTY 세션 상태를 사용할 수 없습니다.
zh_hans: 一个或多个工作区的远程 PTY 会话状态不可用。
zh_hant: 一個或多個工作區無法使用遠端 PTY 工作階段狀態。

# cli.surface.error.handleBlank
source: Surface handle is blank
ar: معرّف السطح فارغ
bs: Ručka površine je prazna
da: Overfladehåndtaget er tomt
de: Oberflächen-Handle ist leer
es: El identificador de superficie está vacío
fr: L’identifiant de surface est vide
it: L'handle della superficie è vuoto
ja: サーフェスハンドルが空です
ko: 서피스 핸들이 비어 있습니다
nb: Overflatehåndtaket er tomt
pl: Uchwyt powierzchni jest pusty
pt_br: O identificador da superfície está vazio
ru: Дескриптор поверхности пуст
th: แฮนเดิลพื้นผิวว่างเปล่า
tr: Yüzey tanıtıcısı boş
uk: Дескриптор поверхні порожній
zh_hans: 表面句柄为空
zh_hant: 介面控制代碼為空

# cli.surface.error.indexNotFound
source: Surface index not found
ar: لم يتم العثور على فهرس السطح
bs: Indeks površine nije pronađen
da: Overfladeindeks blev ikke fundet
de: Oberflächenindex nicht gefunden
es: No se encontró el índice de superficie
fr: Index de surface introuvable
it: Indice superficie non trovato
ja: サーフェスインデックスが見つかりません
ko: 서피스 인덱스를 찾을 수 없습니다
nb: Fant ikke overflateindeks
pl: Nie znaleziono indeksu powierzchni
pt_br: Índice de superfície não encontrado
ru: Индекс поверхности не найден
th: ไม่พบดัชนีพื้นผิว
tr: Yüzey dizini bulunamadı
uk: Індекс поверхні не знайдено
zh_hans: 未找到表面索引
zh_hant: 找不到介面索引

# cli.surface.error.invalidHandle
source: Invalid surface handle: %@ (expected UUID, ref like surface:1, or index)
ar: معرّف سطح غير صالح: %@ (المتوقع UUID أو مرجع مثل surface:1 أو فهرس)
bs: Nevažeća ručka površine: %@ (očekuje se UUID, referenca poput surface:1 ili indeks)
da: Ugyldigt overfladehåndtag: %@ (forventede UUID, reference som surface:1 eller indeks)
de: Ungültiges Oberflächen-Handle: %@ (UUID, Referenz wie surface:1 oder Index erwartet)
es: Identificador de superficie no válido: %@ (se esperaba UUID, referencia como surface:1 o índice)
fr: Identifiant de surface invalide: %@ (UUID, référence comme surface:1 ou index attendu)
it: Handle superficie non valido: %@ (previsto UUID, riferimento come surface:1 o indice)
ja: 無効なサーフェスハンドル: %@ (UUID、surface:1 のような参照、またはインデックスを指定してください)
ko: 잘못된 서피스 핸들: %@ (UUID, surface:1 같은 참조 또는 인덱스 필요)
nb: Ugyldig overflatehåndtak: %@ (forventet UUID, referanse som surface:1 eller indeks)
pl: Nieprawidłowy uchwyt powierzchni: %@ (oczekiwano UUID, odwołania jak surface:1 albo indeksu)
pt_br: Identificador de superfície inválido: %@ (esperado UUID, referência como surface:1 ou índice)
ru: Недопустимый дескриптор поверхности: %@ (ожидается UUID, ссылка вида surface:1 или индекс)
th: แฮนเดิลพื้นผิวไม่ถูกต้อง: %@ (ต้องเป็น UUID การอ้างอิงเช่น surface:1 หรือดัชนี)
tr: Geçersiz yüzey tanıtıcısı: %@ (UUID, surface:1 gibi başvuru veya dizin beklenir)
uk: Недійсний дескриптор поверхні: %@ (очікується UUID, посилання на кшталт surface:1 або індекс)
zh_hans: 无效的表面句柄: %@ (应为 UUID、类似 surface:1 的引用或索引)
zh_hant: 無效的介面控制代碼: %@ (預期 UUID、類似 surface:1 的參照或索引)

# cli.surface.error.notFound
source: Surface not found: %@
ar: لم يتم العثور على السطح: %@
bs: Površina nije pronađena: %@
da: Overflade blev ikke fundet: %@
de: Oberfläche nicht gefunden: %@
es: No se encontró la superficie: %@
fr: Surface introuvable: %@
it: Superficie non trovata: %@
ja: サーフェスが見つかりません: %@
ko: 서피스를 찾을 수 없습니다: %@
nb: Fant ikke overflate: %@
pl: Nie znaleziono powierzchni: %@
pt_br: Superfície não encontrada: %@
ru: Поверхность не найдена: %@
th: ไม่พบพื้นผิว: %@
tr: Yüzey bulunamadı: %@
uk: Поверхню не знайдено: %@
zh_hans: 未找到表面: %@
zh_hant: 找不到介面: %@

# cli.surface.error.refNotFound
source: Surface ref not found: %@
ar: لم يتم العثور على مرجع السطح: %@
bs: Referenca površine nije pronađena: %@
da: Overfladereference blev ikke fundet: %@
de: Oberflächenreferenz nicht gefunden: %@
es: No se encontró la referencia de superficie: %@
fr: Référence de surface introuvable: %@
it: Riferimento superficie non trovato: %@
ja: サーフェス参照が見つかりません: %@
ko: 서피스 참조를 찾을 수 없습니다: %@
nb: Fant ikke overflatereferanse: %@
pl: Nie znaleziono odwołania do powierzchni: %@
pt_br: Referência de superfície não encontrada: %@
ru: Ссылка на поверхность не найдена: %@
th: ไม่พบการอ้างอิงพื้นผิว: %@
tr: Yüzey referansı bulunamadı: %@
uk: Посилання на поверхню не знайдено: %@
zh_hans: 未找到表面引用: %@
zh_hant: 找不到介面參照: %@
